src/Catalogs/рнсПравилаПолученияДанныхИБ/рнсПравилаПолученияДанныхИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рнсПравилаПолученияДанныхИБ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТекстЗапросаПоУмолч</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантВыполнения</name>
    <type>
      <types>EnumRef.рнсВариантВыполненияПравила</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаПоУмолчанию</name>
    <type>
      <types>CatalogRef.рнсНастройкиВыполненияПравил</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.рнсГруппыДоступаРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКолонкиРезультата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдинственноеЗначение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимРаботы</name>
    <comment>0 - Стандартный, 1 - По списку настроек, 2 - Расширенный</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИгнорироватьСтруктуру</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширенныеВозможностиНастроек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерФиксированногоЗапросаВПакете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСписокОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/рнсНастройкиПолученияЗначений/рнсНастройкиПолученияЗначений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рнсНастройкиПолученияЗначений</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.рнсТипыРасширенныхНастроек</types>
    </type>
  </resources>
  <attributes>
    <name>Отключено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Правило</name>
    <type>
      <types>CatalogRef.рнсПравилаПолученияДанныхИБ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УсловиеВыполнения</name>
    <type>
      <types>CatalogRef.рнсНастройкиВыполненияПравил</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/рнсВариантВыполненияПравила/рнсВариантВыполненияПравила.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рнсВариантВыполненияПравила</name>
  <enumValues>
    <name>СхемаКомпоновки</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСОбъединением</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСУсловием</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/рнсНастройкиВыполненияПравил/рнсНастройкиВыполненияПравил.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рнсНастройкиВыполненияПравил</name>
  <basedOn>Catalog.рнсПравилаПолученияДанныхИБ</basedOn>
  <owners>Catalog.рнсПравилаПолученияДанныхИБ</owners>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеПараметров</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененаВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеНаборы</name>
    <attributes>
      <name>ИмяНабора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолучитьПоПравилу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеВнешнегоНабора</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Правило</name>
      <type>
        <types>CatalogRef.рнсПравилаПолученияДанныхИБ</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеВыполнения</name>
      <type>
        <types>CatalogRef.рнсНастройкиВыполненияПравил</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыВложенныхПравил</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/рнсПравилаПолученияДанныхИБ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает результат выполнения правила
//
// Параметры:
//  Правило					 - СправочникСсылка.рнсПравилаПолученияДанныхИБ, Строка	 - Правило, код или наименование
//  ПараметрыКомпоновки		 - Структура	 - структура параметров
//  НастройкаКомпоновки		 - МенеджерВременныхТаблиц, НастройкиКомпоновки, СправочникСсылка.рнсНастройкиВыполненияПравил 	- настройки выполнения
//                                менедежер временных таблиц должен содержать таблицу "Вт_ТаблицаРучныхНастроек" с колонками: 
//                                УсловиеВыполнения, Порядок, Значение
//  ДополнительныеПараметры	 - Структура	 -  дополнительные параметры компоновки
// 
// Возвращаемое значение:
//   - Произвольный - результат выполнения правила
//
Функция ВыполнитьПравило(Правило, ПараметрыКомпоновки = Неопределено, НастройкаКомпоновки = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	         	          	
	Результат 	= Неопределено; 
	ТипПравила	= ТипЗнч(Правило);
	Запрос	 	= Новый Запрос;
	
	Если ТипПравила = Тип("Строка") Тогда		
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТаблицаПравил.СхемаКомпоновкиДанных КАК СхемаКомпоновкиДанных,
		               |	ТаблицаПравил.ВариантВыполнения КАК ВариантВыполнения,
		               |	ТаблицаПравил.НастройкаПоУмолчанию КАК НастройкаПоУмолчанию,
		               |	ТаблицаПравил.ИмяКолонкиРезультата КАК ИмяКолонки,
		               |	ТаблицаПравил.ЕдинственноеЗначение КАК ЕдинственноеЗначение,
		               |	ТаблицаПравил.РежимРаботы КАК РежимРаботы,
		               |	ТаблицаПравил.ИгнорироватьСтруктуру КАК ИгнорироватьСтруктуру,
		               |	ТаблицаПравил.ЭтоГруппа КАК ЭтоГруппа,
		               |	ТаблицаПравил.Ссылка КАК Правило,
		               |	ТаблицаПравил.НомерФиксированногоЗапросаВПакете КАК НомерФиксированногоЗапросаВПакете,
		               |	ТаблицаПравил.ИспользуетсяСписокОбъектов КАК ИспользуетсяСписокОбъектов
		               |ИЗ
		               |	Справочник.рнсПравилаПолученияДанныхИБ КАК ТаблицаПравил
		               |ГДЕ
		               |	ТаблицаПравил.Код = &Правило
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ТаблицаПравил.СхемаКомпоновкиДанных,
		               |	ТаблицаПравил.ВариантВыполнения,
		               |	ТаблицаПравил.НастройкаПоУмолчанию,
		               |	ТаблицаПравил.ИмяКолонкиРезультата,
		               |	ТаблицаПравил.ЕдинственноеЗначение,
		               |	ТаблицаПравил.РежимРаботы,
		               |	ТаблицаПравил.ИгнорироватьСтруктуру,
		               |	ТаблицаПравил.ЭтоГруппа,
		               |	ТаблицаПравил.Ссылка,
		               |	ТаблицаПравил.НомерФиксированногоЗапросаВПакете,
		               |	ТаблицаПравил.ИспользуетсяСписокОбъектов
		               |ИЗ
		               |	Справочник.рнсПравилаПолученияДанныхИБ КАК ТаблицаПравил
		               |ГДЕ
		               |	ТаблицаПравил.Наименование = &Правило";
		
		Запрос.УстановитьПараметр("Правило", Правило);	
		
	ИначеЕсли ТипПравила = Тип("СправочникСсылка.рнсНастройкиВыполненияПравил") Тогда
		
		НастройкаКомпоновки = Правило;	
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТаблицаПравил.СхемаКомпоновкиДанных КАК СхемаКомпоновкиДанных,
		               |	ТаблицаПравил.ВариантВыполнения КАК ВариантВыполнения,
		               |	ТаблицаПравил.НастройкаПоУмолчанию КАК НастройкаПоУмолчанию,
		               |	ТаблицаПравил.ИмяКолонкиРезультата КАК ИмяКолонки,
		               |	ТаблицаПравил.ЕдинственноеЗначение КАК ЕдинственноеЗначение,
		               |	ТаблицаПравил.РежимРаботы КАК РежимРаботы,
		               |	ТаблицаПравил.ИгнорироватьСтруктуру КАК ИгнорироватьСтруктуру,
		               |	ТаблицаПравил.ЭтоГруппа КАК ЭтоГруппа,
		               |	ТаблицаПравил.Ссылка КАК Правило,
		               |	ТаблицаПравил.НомерФиксированногоЗапросаВПакете КАК НомерФиксированногоЗапросаВПакете,
		               |	ТаблицаПравил.ИспользуетсяСписокОбъектов КАК ИспользуетсяСписокОбъектов
		               |ИЗ
		               |	Справочник.рнсПравилаПолученияДанныхИБ КАК ТаблицаПравил
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.рнсНастройкиВыполненияПравил КАК рнсНастройкиВыполненияПравил
		               |		ПО ТаблицаПравил.Ссылка = рнсНастройкиВыполненияПравил.Владелец
		               |ГДЕ
		               |	рнсНастройкиВыполненияПравил.Ссылка = &Настройка";
		
		Запрос.УстановитьПараметр("Настройка", Правило);	
		
	Иначе
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТаблицаПравил.СхемаКомпоновкиДанных КАК СхемаКомпоновкиДанных,
		               |	ТаблицаПравил.ВариантВыполнения КАК ВариантВыполнения,
		               |	ТаблицаПравил.НастройкаПоУмолчанию КАК НастройкаПоУмолчанию,
		               |	ТаблицаПравил.ИмяКолонкиРезультата КАК ИмяКолонки,
		               |	ТаблицаПравил.ЕдинственноеЗначение КАК ЕдинственноеЗначение,
		               |	ТаблицаПравил.РежимРаботы КАК РежимРаботы,
		               |	ТаблицаПравил.ИгнорироватьСтруктуру КАК ИгнорироватьСтруктуру,
		               |	ТаблицаПравил.ЭтоГруппа КАК ЭтоГруппа,
		               |	ТаблицаПравил.Ссылка КАК Правило,
		               |	ТаблицаПравил.НомерФиксированногоЗапросаВПакете КАК НомерФиксированногоЗапросаВПакете,
		               |	ТаблицаПравил.ИспользуетсяСписокОбъектов КАК ИспользуетсяСписокОбъектов
		               |ИЗ
		               |	Справочник.рнсПравилаПолученияДанныхИБ КАК ТаблицаПравил
		               |ГДЕ
		               |	ТаблицаПравил.Ссылка = &Правило";
		
		Запрос.УстановитьПараметр("Правило", Правило);
		
	КонецЕсли;			
	
	РезультатЗапроса 	= Запрос.Выполнить();   		
	Реквизиты 			= РезультатЗапроса.Выбрать();	
	
	Если Реквизиты.Следующий() Тогда  		
		
		ПараметрыВыполнения = ИнициализироватьПараметрыВыполнения(Реквизиты, ДополнительныеПараметры); 
		
		Если Реквизиты.РежимРаботы = 1 Тогда 
			Если НастройкаКомпоновки = Неопределено ИЛИ НастройкаКомпоновки	= Справочники.рнсНастройкиВыполненияПравил.ПустаяСсылка() Тогда
				Результат = ПолучитьРезультатПоСпискуЗначений(ПараметрыКомпоновки, ПараметрыВыполнения);
			ИначеЕсли ТипЗнч(НастройкаКомпоновки) = Тип("МенеджерВременныхТаблиц") Тогда    
				Результат = ПолучитьРезультатПоСпискуЗначений(ПараметрыКомпоновки, ПараметрыВыполнения, НастройкаКомпоновки);	
			Иначе
				Результат = ПолучитьРезультатСтандартныйРежим(ПараметрыКомпоновки, НастройкаКомпоновки, ПараметрыВыполнения);	
			КонецЕсли; 	
		ИначеЕсли Реквизиты.РежимРаботы = 2 Тогда 
			Результат = ПолучитьРезультатРасширенныйРежим(ПараметрыВыполнения, ПараметрыКомпоновки);
		Иначе 
			Результат = ПолучитьРезультатСтандартныйРежим(ПараметрыКомпоновки, НастройкаКомпоновки, ПараметрыВыполнения);
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти    

#Область СлужебныеПроцедурыИФункции   

Функция ПолучитьРезультатСтандартныйРежим(ПараметрыСКД, НастройкаКомпоновки, ПараметрыВыполнения)
	
	Результат = Неопределено; 		
	
	Если НастройкаКомпоновки = Неопределено ИЛИ НастройкаКомпоновки = Справочники.рнсНастройкиВыполненияПравил.ПустаяСсылка() Тогда
		Если ЗначениеЗаполнено(ПараметрыВыполнения.НастройкаПоУмолчанию) Тогда  			
			ДополнитьПараметрыВыполнения(ПараметрыВыполнения.НастройкаПоУмолчанию, ПараметрыВыполнения);			
		Иначе
			ПараметрыВыполнения.Вставить("Настройка", ПараметрыВыполнения.Схема.НастройкиПоУмолчанию);  				
		КонецЕсли; 			
	Иначе
		Если ТипЗнч(НастройкаКомпоновки) = Тип("СправочникСсылка.рнсНастройкиВыполненияПравил") Тогда
			ДополнитьПараметрыВыполнения(НастройкаКомпоновки, ПараметрыВыполнения);			  							
		Иначе 	
			ПараметрыВыполнения.Вставить("Настройка", НастройкаКомпоновки);  			
		КонецЕсли;  												
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыВыполнения.ТекстЗапроса) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = ПараметрыВыполнения.ТекстЗапроса;
		
		Для каждого Ит Из ПараметрыВыполнения.КоллекцияПараметров Цикл  
			Запрос.УстановитьПараметр(Ит.Ключ, Ит.Значение);			   						
		КонецЦикла;   	
		
		Если ЗначениеЗаполнено(ПараметрыСКД) Тогда
			Для каждого Ит Из ПараметрыСКД Цикл  
				Запрос.УстановитьПараметр(Ит.Ключ, Ит.Значение);			   						
			КонецЦикла;	
		КонецЕсли;		 
		
		РезультатЗапроса = Запрос.Выполнить();  		
		
		Если ЗначениеЗаполнено(ПараметрыВыполнения.ИмяКолонки) Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Если ПараметрыВыполнения.ЕдинственноеЗначение Тогда
				Если Выборка.Следующий() Тогда
					Результат = Выборка[ПараметрыВыполнения.ИмяКолонки];	
				КонецЕсли;  			
			Иначе
				
				Результат = Новый Массив;
				
				Пока Выборка.Следующий() Цикл
					Результат.Добавить(Выборка[ПараметрыВыполнения.ИмяКолонки]);		
				КонецЦикла; 
				
			КонецЕсли; 
			
		Иначе 			
			Результат = РезультатЗапроса.Выгрузить();		
		КонецЕсли; 
		
	Иначе
		Результат = РезультатВыполненияСхемы(ПараметрыВыполнения.Схема, ПараметрыСКД, ПараметрыВыполнения);	
	КонецЕсли; 	 
	
	Возврат Результат;
	
КонецФункции    

Функция ПолучитьРезультатПоСпискуЗначений(ПараметрыСКД, ПараметрыВыполнения, РучнойСписокНастроек = Неопределено)
	
	Результат 				= Неопределено;	    
	СтрокаСвойствРезультата = "Порядок, Значение"; 
	Запрос 					= Новый Запрос;
	
	Если РучнойСписокНастроек = Неопределено Тогда 	
	
		Запрос.Текст = "ВЫБРАТЬ
		               |	Таблица.Значение КАК Значение,
		               |	ЕСТЬNULL(Таблица.УсловиеВыполнения.ХранилищеНастроекКомпоновкиДанных, НЕОПРЕДЕЛЕНО) КАК ХранилищеНастроек,
		               |	Таблица.Порядок КАК Порядок,
		               |	Таблица.УсловиеВыполнения.ХранилищеПараметров КАК ХранилищеПараметров,
		               |	Таблица.УсловиеВыполнения.ТекстЗапроса КАК ТекстЗапроса
		               |ИЗ
		               |	РегистрСведений.рнсНастройкиПолученияЗначений КАК Таблица
		               |ГДЕ
		               |	Таблица.Правило = &Правило
		               |	И НЕ Таблица.Отключено
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Таблица.Порядок УБЫВ"; 
		
	Иначе
		
		Запрос.МенеджерВременныхТаблиц = РучнойСписокНастроек;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Таблица.Значение КАК Значение,
		               |	рнсНастройкиВыполненияПравил.ХранилищеНастроекКомпоновкиДанных КАК ХранилищеНастроек,
		               |	Таблица.Порядок КАК Порядок,
		               |	рнсНастройкиВыполненияПравил.ХранилищеПараметров КАК ХранилищеПараметров,
		               |	рнсНастройкиВыполненияПравил.ТекстЗапроса КАК ТекстЗапроса
		               |ИЗ
		               |	Вт_ТаблицаРучныхНастроек КАК Таблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.рнсНастройкиВыполненияПравил КАК рнсНастройкиВыполненияПравил
		               |		ПО Таблица.УсловиеВыполнения = рнсНастройкиВыполненияПравил.Ссылка
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Таблица.Порядок УБЫВ";	
	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Правило", ПараметрыВыполнения.Правило);		
	
	РезультатЗапроса = Запрос.Выполнить();	
	
	Если НЕ РезультатЗапроса.Пустой() Тогда  	 
		
		ВыборкаВариантыЗначений = РезультатЗапроса.Выбрать();			 			
		
		Если ПараметрыВыполнения.ВариантВыполнения = Перечисления.рнсВариантВыполненияПравила.ЗапросСОбъединением Тогда
			                        			
			РезультатЗапроса = ЗапросСОбъединением(ВыборкаВариантыЗначений, ПараметрыСКД, ПараметрыВыполнения).Выполнить(); 
			
			Если ПараметрыВыполнения.ИспользуетсяСписокОбъектов Тогда  				
				Результат = РезультатЗапроса.Выгрузить();				
			Иначе
				
				ВыборкаДетальныеЗаписи 	= РезультатЗапроса.Выбрать();
				
				Если ПараметрыВыполнения.ЕдинственноеЗначение Тогда  		
					Если ВыборкаДетальныеЗаписи.Следующий() Тогда 				
						Если ПараметрыВыполнения.ПорядокЗначение Тогда
							Результат = Новый Структура(СтрокаСвойствРезультата, ВыборкаДетальныеЗаписи.СП_Порядок, ВыборкаДетальныеЗаписи.СП_ЗначениеСвойства);	
						Иначе
							Результат = ВыборкаДетальныеЗаписи.СП_ЗначениеСвойства;
						КонецЕсли; 			
					КонецЕсли;  			
				Иначе
					
					Результат = Новый Массив;
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						Если ПараметрыВыполнения.ПорядокЗначение Тогда
							Результат.Добавить(Новый Структура(СтрокаСвойствРезультата, ВыборкаДетальныеЗаписи.СП_Порядок, ВыборкаДетальныеЗаписи.СП_ЗначениеСвойства));	
						Иначе
							Результат.Добавить(ВыборкаДетальныеЗаписи.СП_ЗначениеСвойства);
						КонецЕсли; 	
					КонецЦикла; 		
					
				КонецЕсли;
				
			КонецЕсли; 			
			
		ИначеЕсли ПараметрыВыполнения.ВариантВыполнения = Перечисления.рнсВариантВыполненияПравила.ЗапросСУсловием Тогда  
			
			РезультатЗапроса = ЗапросСУсловием(ВыборкаВариантыЗначений, ПараметрыСКД, ПараметрыВыполнения).Выполнить();
			
			
			Возврат Результат; 	
			
		Иначе					
			
			ПродолжатьВыполнение = Истина; 
			
			Если ПараметрыВыполнения.ЕдинственноеЗначение Тогда 		 
				
				Пока ВыборкаВариантыЗначений.Следующий() И ПродолжатьВыполнение Цикл 				
					Если ВыборкаВариантыЗначений.ХранилищеНастроек <> Неопределено Тогда   
						
						НастройкиСКД 			= ВыборкаВариантыЗначений.ХранилищеНастроек.Получить();					
						ТекРезультат 			= ПолучитьРезультатСтандартныйРежим(ПараметрыСКД, НастройкиСКД, ПараметрыВыполнения); 					
						ПродолжатьВыполнение 	= НЕ ЗначениеЗаполнено(ТекРезультат); 
						
						Если НЕ ПродолжатьВыполнение Тогда
							Если ПараметрыВыполнения.ПорядокЗначение Тогда
								Результат = Новый Структура(СтрокаСвойствРезультата, ВыборкаВариантыЗначений.Порядок, ВыборкаВариантыЗначений.Значение);	
							Иначе
								Результат = ВыборкаВариантыЗначений.Значение;
							КонецЕсли;  						
						КонецЕсли;					 					 
						
					КонецЕсли;  		
				КонецЦикла; 
				
			Иначе
				
				Результат = Новый Массив;
				
				Пока ВыборкаВариантыЗначений.Следующий() Цикл 				
					Если ВыборкаВариантыЗначений.ХранилищеНастроек <> Неопределено Тогда   
						
						НастройкиСКД 	= ВыборкаВариантыЗначений.ХранилищеНастроек.Получить();					
						ТекРезультат 	= ПолучитьРезультатСтандартныйРежим(ПараметрыСКД, НастройкиСКД, ПараметрыВыполнения);					 
						
						Если ЗначениеЗаполнено(ТекРезультат) Тогда
							Если ПараметрыВыполнения.ПорядокЗначение Тогда
								Результат.Добавить(Новый Структура(СтрокаСвойствРезультата, ВыборкаВариантыЗначений.Порядок, ВыборкаВариантыЗначений.Значение));	
							Иначе
								Результат.Добавить(ВыборкаВариантыЗначений.Значение);
							КонецЕсли;  						
						КонецЕсли;					 					 
						
					КонецЕсли;  		
				КонецЦикла;
				
			КонецЕсли; 		
			
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
 
Функция ПолучитьРезультатРасширенныйРежим(ПараметрыСКД, ПараметрыВыполнения)
	
	Результат = Неопределено;
	
	Возврат Результат;
	
КонецФункции
      
Функция ДополнитьПараметрыВыполнения(НастройкаППД, ПараметрыВыполнения)
	 	
	Результат = Истина;   	
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаНастроек.ХранилищеНастроекКомпоновкиДанных КАК ХранилищеНастроекКомпоновкиДанных,
		|	ТаблицаНастроек.ХранилищеПараметров КАК ХранилищеПараметров,
		|	ТаблицаНастроек.ТекстЗапроса КАК ТекстЗапроса,
		|	ВЫРАЗИТЬ(ТаблицаНастроек.ТекстЗапроса КАК СТРОКА(10)) = """"
		|				ИЛИ &ВариантВыполнения = ЗНАЧЕНИЕ(Перечисление.рнсВариантВыполненияПравила.СхемаКомпоновки) КАК ВыполнитьСКД
		|ИЗ
		|	Справочник.рнсНастройкиВыполненияПравил КАК ТаблицаНастроек
		|ГДЕ
		|	ТаблицаНастроек.Ссылка = &НастройкаППД";
	
	Запрос.УстановитьПараметр("ВариантВыполнения", ПараметрыВыполнения.ВариантВыполнения);
	Запрос.УстановитьПараметр("НастройкаППД", НастройкаППД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.ВыполнитьСКД Тогда
			ПараметрыВыполнения.Вставить("Настройка", Выборка.ХранилищеНастроекКомпоновкиДанных.Получить()); 			
		Иначе
			ПараметрыВыполнения.Вставить("КоллекцияПараметров", Выборка.ХранилищеПараметров.Получить());
			ПараметрыВыполнения.Вставить("ТекстЗапроса", Выборка.ТекстЗапроса);   				
		КонецЕсли; 	 		             					  
					   
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции
     
Функция РезультатВыполненияСхемы(СКД, ПараметрыСКД, ПараметрыВыполнения)
                                        
	НастройкиСКД				= ПараметрыВыполнения.Настройка;  	
	КомпоновщикМакета 			= Новый КомпоновщикМакетаКомпоновкиДанных; 
	ПроцессорКомпоновкиДанных 	= Новый ПроцессорКомпоновкиДанных;
	ПроцессорВывода 			= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	                                            	
	Если ПараметрыВыполнения.ИгнорироватьСтруктуру Тогда
		
		КоллекцияРезультат = Новый ТаблицаЗначений;  		
		
		НастройкиСКД.Структура.Очистить();
		
		ГКД = НастройкиСКД.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		ГКД.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		ГКД.Использование = Истина;		
		
	Иначе   		
		Если рнсСлужебный.ЕстьИерархияВывода(НастройкиСКД) Тогда
			КоллекцияРезультат = Новый ДеревоЗначений;	
		Иначе
			КоллекцияРезультат = Новый ТаблицаЗначений;	
		КонецЕсли; 
	КонецЕсли;	
	
	Если ПараметрыСКД <> Неопределено Тогда 	 
		Для каждого Ит Из ПараметрыСКД Цикл
			УстановитьЗначениеПараметра(НастройкиСКД, Ит.Ключ, Ит.Значение); 	
		КонецЦикла; 	
	КонецЕсли;   	
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, НастройкиСКД, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));	
	
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ПараметрыВыполнения.ВнешниеНаборы, , Истина);
	 	
	ПроцессорВывода.УстановитьОбъект(КоллекцияРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);   

	Если ЗначениеЗаполнено(ПараметрыВыполнения.ИмяКолонки) И ТипЗнч(КоллекцияРезультат) = Тип("ТаблицаЗначений") Тогда
		Если ПараметрыВыполнения.ЕдинственноеЗначение Тогда
			Если ЗначениеЗаполнено(КоллекцияРезультат) Тогда
				Результат = КоллекцияРезультат[0][ПараметрыВыполнения.ИмяКолонки];	
			КонецЕсли; 						
		Иначе
			Результат = КоллекцияРезультат.ВыгрузитьКолонку(ПараметрыВыполнения.ИмяКолонки);				
		КонецЕсли; 
	Иначе
		Результат = КоллекцияРезультат;
	КонецЕсли; 
	
	Возврат Результат;

КонецФункции

Процедура УстановитьЗначениеПараметра(Настройки, ИмяПараметра, Значение, Использование = Истина)
	
	ПараметрДанных = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	Если ПараметрДанных <> Неопределено Тогда
		ПараметрДанных.Значение 		= Значение;	
		ПараметрДанных.Использование 	= Использование;	
	КонецЕсли; 	
	
КонецПроцедуры   

Функция ИнициализироватьПараметрыВыполнения(Реквизиты, ДополнительныеПараметры = Неопределено)
	
	Результат = Новый Структура("Правило, Схема, ИмяКолонки, ЕдинственноеЗначение, ВнешниеНаборы, ПорядокЗначение, 
									| НастройкаПоУмолчанию, ВариантВыполнения, ИгнорироватьСтруктуру, ТекстЗапроса,
									| НомерФиксированногоЗапросаВПакете, ИспользуетсяСписокОбъектов, Выбор");
	                                             		
	ЗаполнитьЗначенияСвойств(Результат, Реквизиты);	 
	
	Результат.Выбор = Новый Массив;
	Результат.Схема = Реквизиты.СхемаКомпоновкиДанных.Получить(); 	
	Результат.Вставить("ПорядокЗначение", Ложь);  
	
	Для каждого Ит Из Результат.Схема.НастройкиПоУмолчанию.Выбор.Элементы Цикл  	
		ИмяПоля = Строка(Ит.Поле);
		Результат.Выбор.Добавить(ИмяПоля); 		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Результат, ДополнительныеПараметры, Истина);	
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Функция ЗапросСОбъединением(ВыборкаВариантыЗначений, ПараметрыСКД, ПараметрыВыполнения)	
	
	Результат 							= Новый Запрос;
	ПараметрыЗапроса 					= Новый Структура;
	ДобавленаФиксированнаяЧасть 		= Ложь; 
	ФиксированныеПараметры 				= Новый Массив;
	НПП									= 0;  
	МассивЗапросов 						= Новый Массив;
	ТекущаяСхемаЗапроса 				= Новый СхемаЗапроса; 
	ВременныеТаблицыКЗамене				= Новый Массив;
	НеФиксированныеЗапросыПакета    	= Новый Массив;  
	ИменаФиксированныхЗапросовПакета	= Новый Массив;
	МассивЗапросовОбъединения			= Новый Массив;  
	ИндексФиксированногоЗапроса			= ПараметрыВыполнения.НомерФиксированногоЗапросаВПакете - 1; 
	ЗаполнитьФиксированныеЗапросы		= ИндексФиксированногоЗапроса >= 0; 
	МассивКолонок						= Новый Массив;
	МассивКолонокСоединения             = Новый Массив;
	
	Для каждого Ит Из ПараметрыВыполнения.Выбор Цикл 		 	
		МассивКолонок.Добавить("Таблица." + Ит);
		МассивКолонокСоединения.Добавить("Таблица." + Ит + " = Т." + Ит);	 	
	КонецЦикла;
	
	ТекстГруппировкиВыборка = СтрСоединить(МассивКолонок, "," + Символы.ПС);   
	ТекстСоединения	= СтрСоединить(МассивКолонокСоединения, Символы.ПС + " И "); 				
	
	Если ПараметрыВыполнения.ИспользуетсяСписокОбъектов Тогда 		
		
		Если ПараметрыВыполнения.ЕдинственноеЗначение Тогда  
			
			ШаблонИтоговогоЗапроса = 
			"ВЫБРАТЬ  		
			|	Таблица.СП_ЗначениеСвойства, 
			|	Таблица.СП_Порядок, 
			|	&ПоляВыбора
			|ПОМЕСТИТЬ СП_ТаблицаПредварительная
			|ИЗ
			|	(#ТекстЗапросаПоСвойствам#) КАК Таблица
			|;
			|//////////////////////////////////////////////////////////////// 	
			|ВЫБРАТЬ						
			|	МАКСИМУМ(Таблица.СП_Порядок) КАК СП_Порядок,
			|	&ПоляВыбор  
			|ПОМЕСТИТЬ Вт_ПорядокТаблица
			|	ИЗ
			|	СП_ТаблицаПредварительная КАК Таблица
			|		
			|СГРУППИРОВАТЬ ПО
			|	&ПоляВыбора
			|
			|;
			|//////////////////////////////////////////////////////////////// 
			|ВЫБРАТЬ
			|	Таблица.ПоляВыбора КАК ПоляВыбора,
			|	Таблица.СП_ЗначениеСвойства КАК СП_ЗначениеСвойства,
			|	Таблица.СП_Порядок КАК СП_Порядок
			|ИЗ
			|	СП_ТаблицаПредварительная КАК Таблица
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Вт_ПорядокТаблица КАК Т
			|		ПО &ПоляСоединения 
			|			И Таблица.СП_Порядок = Т.СП_Порядок";
			
			ШаблонИтоговогоЗапроса = СтрЗаменить(ШаблонИтоговогоЗапроса, "&ПоляСоединения", ТекстСоединения);	
			
		Иначе			  
			
			ШаблонИтоговогоЗапроса = 
			"ВЫБРАТЬ  		
			|	Таблица.СП_ЗначениеСвойства, 
			|	Таблица.СП_Порядок,
			|	&ПоляВыбора
			|ИЗ
			|	(#ТекстЗапросаПоСвойствам#) КАК Таблица
			|УПОРЯДОЧИТЬ ПО 
			|	СП_Порядок УБЫВ";  		
			
		КонецЕсли;		
		
	Иначе
		
		ШаблонИтоговогоЗапроса = 
		"ВЫБРАТЬ " + ?(ПараметрыВыполнения.ЕдинственноеЗначение, "ПЕРВЫЕ 1", "") + "		
		|	Таблица.СП_ЗначениеСвойства, 
		|	Таблица.СП_Порядок,
		| 	&ПоляВыбора
		|ИЗ
		|	(#ТекстЗапросаПоСвойствам#) КАК Таблица
		|УПОРЯДОЧИТЬ ПО 
		|	СП_Порядок УБЫВ";
		
	КонецЕсли; 	  
	
	Пока ВыборкаВариантыЗначений.Следующий() Цикл   	
		
		ТекстЗапроса 					= ВыборкаВариантыЗначений.ТекстЗапроса;
		ПараметрыИзНастройки 			= ВыборкаВариантыЗначений.ХранилищеПараметров.Получить();
		НПП								= НПП + 1; 
		ПостФикс						= "_" + Формат(НПП, "ЧГ=0");
		
		ТекущаяСхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);  	
		  
		ВременныеТаблицыКЗамене.Очистить();  
		НеФиксированныеЗапросыПакета.Очистить();
		
		// Если в схеме пакетный запрос, то
		// 1. выделяю фиксированную часть
		// 2. запросы пакета, с меняющимися параметрами от настройки к настройке (подмена имен параметров, имен ВТ)
		// 3. итоговый запрос объединения (подмена имен параметров, имен ВТ)
		
		Если ТекущаяСхемаЗапроса.ПакетЗапросов.Количество() > 1 Тогда 					
			
			ИндексИтоговогоЗапроса = ТекущаяСхемаЗапроса.ПакетЗапросов.Количество() - 1;
			
			// подготовка фиксированной части запроса
			
			Если ЗаполнитьФиксированныеЗапросы Тогда 				
				
				Для Сч = 0 По ИндексФиксированногоЗапроса Цикл
					
					ТекущийПакет 	= ТекущаяСхемаЗапроса.ПакетЗапросов[Сч];
					ТекстЗапроса  	= ТекущийПакет.ПолучитьТекстЗапроса();
					ТекущийЗапрос 	= Новый Запрос(ТекстЗапроса);  					
					          
					Для каждого ОписаниеПараметра Из ТекущийЗапрос.НайтиПараметры() Цикл 
						
						ЗначениеПараметра = Неопределено;
						
						Если ПараметрыИзНастройки.Свойство(ОписаниеПараметра.Имя, ЗначениеПараметра) Тогда
							ФиксированныеПараметры.Добавить(ОписаниеПараметра.Имя);
							ПараметрыЗапроса.Вставить(ОписаниеПараметра.Имя, ЗначениеПараметра);		
						КонецЕсли;  				
						  					
					КонецЦикла;  
					
					Если ТипЗнч(ТекущийПакет) = Тип("ЗапросВыбораСхемыЗапроса") Тогда
						ИменаФиксированныхЗапросовПакета.Добавить(ТекущийПакет.ТаблицаДляПомещения);
					Иначе
						// Если ВТ уничтожается в фиксированной части, не имеет смысла проверять в нефиксированной
						ИменаФиксированныхЗапросовПакета.Удалить(ТекущийПакет.ИмяТаблицы);	
					КонецЕсли;					
					
					МассивЗапросов.Добавить(ТекстЗапроса);
					
				КонецЦикла;	
				
				ЗаполнитьФиксированныеЗапросы = Ложь;
				
			КонецЕсли;	
			
			// подготовка зависимой от настроек части (без итогового) запроса			
			 
			Для Сч = ИндексФиксированногоЗапроса + 1 По ИндексИтоговогоЗапроса - 1 Цикл	  
				
				ТекущийПакет 	= ТекущаяСхемаЗапроса.ПакетЗапросов[Сч];  
				Дополнить		= Истина;
				
				Если ТипЗнч(ТекущийПакет) = Тип("ЗапросВыбораСхемыЗапроса") Тогда 						
					ВременныеТаблицыКЗамене.Добавить(ТекущийПакет.ТаблицаДляПомещения);	
				Иначе
					Дополнить = ИменаФиксированныхЗапросовПакета.Найти(ТекущийПакет.ИмяТаблицы) <> Неопределено;
				КонецЕсли;				
				
				ОписаниеЗапроса = Новый Структура("ТекстЗапроса, Дополнить", ТекущийПакет.ПолучитьТекстЗапроса(), Дополнить);
				НеФиксированныеЗапросыПакета.Добавить(ОписаниеЗапроса);					
				
			КонецЦикла;
			
		Иначе	
			ИндексИтоговогоЗапроса = 0;					
		КонецЕсли;  			
		
		// подготовка итогового запроса
		
		ЗапросПакета		= ТекущаяСхемаЗапроса.ПакетЗапросов[ИндексИтоговогоЗапроса];
		КолонкиПакета 		= ЗапросПакета.Колонки;
		КолонкиОператора 	= ЗапросПакета.Операторы[0].ВыбираемыеПоля;  					
		
		КолонкиОператора.Добавить("&СП_ЗначениеСвойства" + ПостФикс, 1); 					 					
		КолонкиОператора.Добавить("&СП_Порядок" + ПостФикс, 2); 
		
		КолонкиПакета[1].Псевдоним = "СП_ЗначениеСвойства";
		КолонкиПакета[2].Псевдоним = "СП_Порядок";
		
		ПараметрыЗапроса.Вставить("СП_Порядок" + ПостФикс, ВыборкаВариантыЗначений.Порядок);
		ПараметрыЗапроса.Вставить("СП_ЗначениеСвойства" + ПостФикс, ВыборкаВариантыЗначений.Значение); 			
		
		// замена параметров и имен ВТ в нефиксированной части запроса			
		
		ТекстЗапросаДляОбъединения = ЗапросПакета.ПолучитьТекстЗапроса(); 		
		
		Для каждого Ит Из ПараметрыИзНастройки Цикл  
			
			Если ФиксированныеПараметры.Найти(Ит.Ключ) = Неопределено 
				И НЕ ПараметрыСКД.Свойство(Ит.Ключ) Тогда // имена параметров из фиксированной части и переданные в процедуру изменять не нужно					
				
				ИмяПараметра 				= Ит.Ключ + ПостФикс; 
				ПодстрокаПоиска 			= "&" + Ит.Ключ;
				ПодстрокаЗамены 			= "&" + ИмяПараметра;
				ТекстЗапросаДляОбъединения 	= СтрЗаменить(ТекстЗапросаДляОбъединения, ПодстрокаПоиска, ПодстрокаЗамены);
				
				Для Сч = 0 По НеФиксированныеЗапросыПакета.ВГраница() Цикл
					НеФиксированныеЗапросыПакета[Сч].ТекстЗапроса = СтрЗаменить(НеФиксированныеЗапросыПакета[Сч].ТекстЗапроса, ПодстрокаПоиска, ПодстрокаЗамены);			
				КонецЦикла;
				
				ПараметрыЗапроса.Вставить(ИмяПараметра, Ит.Значение); 
				
			КонецЕсли;
			
		КонецЦикла;  
		
		Для каждого ИмяВТ Из ВременныеТаблицыКЗамене Цикл		
			
			ИмяВТЗамена 				= ИмяВТ + ПостФикс;
			ТекстЗапросаДляОбъединения 	= СтрЗаменить(ТекстЗапросаДляОбъединения, ИмяВТ, ИмяВТЗамена);
			
			Для Сч = 0 По НеФиксированныеЗапросыПакета.ВГраница() Цикл
				НеФиксированныеЗапросыПакета[Сч].ТекстЗапроса = СтрЗаменить(НеФиксированныеЗапросыПакета[Сч].ТекстЗапроса, ИмяВТ, ИмяВТЗамена);				
			КонецЦикла;
			
		КонецЦикла; 
		
		Для Сч = 0 По НеФиксированныеЗапросыПакета.ВГраница() Цикл  
			
			Индекс 			= Сч + ИндексФиксированногоЗапроса + 1;
			ОписаниеЗапроса = НеФиксированныеЗапросыПакета[Сч];  
			Количество		= МассивЗапросов.ВГраница();
			
			// Получаю такой массив запросов, что
			// запросы пакета от разных настроек идут последовательно,
			// запрос удаления временных таблиц, созданных в фиксированной части, в нефиксированной появляется однократно 
			
			Если ОписаниеЗапроса.Дополнить Тогда  
				Если Индекс > Количество Тогда  
					Элемент = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОписаниеЗапроса.ТекстЗапроса); 					
					МассивЗапросов.Добавить(Элемент);
				Иначе  					
					МассивЗапросов[Индекс].Добавить(ОписаниеЗапроса.ТекстЗапроса);
				КонецЕсли;	
			Иначе
				Если Индекс > Количество Тогда 					 					
					МассивЗапросов.Добавить(ОписаниеЗапроса.ТекстЗапроса); 			
				КонецЕсли;			
			КонецЕсли;			
			
		КонецЦикла;
		
		МассивЗапросовОбъединения.Добавить(ТекстЗапросаДляОбъединения);		
		
	КонецЦикла;   				             								
	
	Для каждого Ит Из ПараметрыЗапроса Цикл
		Результат.УстановитьПараметр(Ит.Ключ, Ит.Значение);	
	КонецЦикла; 
	
	Для каждого Ит Из ПараметрыСКД Цикл
		Результат.УстановитьПараметр(Ит.Ключ, Ит.Значение);	
	КонецЦикла; 	
	
	// формирование пакета из запросов нефиксированной части
	Для Сч = 0 По МассивЗапросов.ВГраница() Цикл   	 		
		Если ТипЗнч(МассивЗапросов[Сч]) = Тип("Массив") Тогда
			МассивЗапросов[Сч] = СтрСоединить(МассивЗапросов[Сч], ОбщегоНазначения.РазделительПакетаЗапросов());		
		КонецЕсли;			
	КонецЦикла;  
	
	ШаблонИтоговогоЗапроса		= СтрЗаменить(ШаблонИтоговогоЗапроса, "&ПоляВыбора", ТекстГруппировкиВыборка);
	ТекстЗапросаПодготовленный 	= СтрСоединить(МассивЗапросовОбъединения, ОбщегоНазначения.ТекстОбъединитьВсе());
	ТекстЗапросаОбъединение		= СтрЗаменить(ШаблонИтоговогоЗапроса, "#ТекстЗапросаПоСвойствам#", ТекстЗапросаПодготовленный); 
	
	МассивЗапросов.Добавить(ТекстЗапросаОбъединение);
	
	Результат.Текст = СтрСоединить(МассивЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Возврат Результат;
	
КонецФункции   

Функция ЗапросСУсловием(ВыборкаВариантыЗначений, ПараметрыСКД, ПараметрыВыполнения)   
	
	// все запросы пакета взять из схемы, без отборов  
	// отборы в итоговом запросе из условий запроса перенести в ВЫБОР КОГДА 
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти  

#КонецЕсли
